% Кербин
%R = 600E3; % радиус планеты
%T = 6*3600; % период обращения
%mu = 3531600000000; % гравитационный параметр

% Минмус
R = 60E3; % радиус планеты
T = 40400; % период обращения
mu = 1.7658000E9; % гравитационный параметр


S = 2*pi*R; % окружность экватора
h=[335:.001:340]*1E3; % предполагаемая орбита
tau = 2.*pi.*sqrt((R+h).^3./mu); % период орбиты
w = 2.*tan(3.*pi/180).*h; % покрытие

[Rtau, RT] = rat(tau/T,1e-3); % рациональное отношение периодов
% tau    Rtau
% --- =  ----
%  T      Rt

uq = ceil(S./w); % необходимое количество уникальных на экваторе

N = RT < uq; % резонансные орбиты
Y = RT >= uq.*1.5 & RT <= uq.*10; % хорошие орбиты
G = RT >= uq & RT <= uq.*1.5; % отличные орбиты
K = RT >= uq.*10; % нерезонансные долгие орбиты

ni = N~=0;
yi = Y~=0;
gi = G~=0;
ki = K~=0;

h = h ./ 1000; % км
%% 
figure
subplot(3,2,1)
plot(h,tau/60,'.');
xlabel('Высота, h');ylabel('Орбитальный период, мин.')
subplot(3,2,2)
plot(h,uq,'.');
xlabel('Высота, h'); ylabel(sprintf('Необходимое кол-во \n пересечений, U'))

subplot(3,2,3)
plot(h(ki),K(ki).*tau(ki)./60,'k.',h(yi),Y(yi).*tau(yi)./60,'.',h(gi),G(gi).*tau(gi)./60,'g.',h(ni),N(ni).*tau(ni)./60,'.r')
xlabel('Высота, h'); ylabel('Орбитальный период, мин.')
subplot(3,2,4)
plot(h(ki),K(ki).*Rtau(ki).*T./3600,'k.',h(yi),Y(yi).*Rtau(yi).*T./3600,'.',h(gi),G(gi).*Rtau(gi).*T./3600,'g.',h(ni),N(ni).*Rtau(ni).*T./3600,'r.')
xlabel('Высота, h');ylabel('Время сканирования, час')
subplot(3,2,5)
plot(h(gi),G(gi).*tau(gi)./60,'g.',h(ni),N(ni).*tau(ni)./60,'r.')
xlabel('Высота, h');ylabel('Орбитальный период, мин.')
subplot(3,2,6)
plot(h(gi),G(gi).*Rtau(gi).*T./3600,'g.',h(ni),N(ni).*Rtau(ni).*T./3600,'r.')
xlabel('Высота, h');ylabel('Время сканирования, час')